fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВсегоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_УчетОтпусков/ВКМ_УчетОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_УчетОтпусков</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Движения.ВКМ_ГрафикОтпусков.Очистить();
	
	Движения.ВКМ_УчетОтпусков.Записывать = Истина;
	Движения.ВКМ_ГрафикОтпусков.Очистить();
	
	ТаблицаДней = ОтпускаСотрудников.Выгрузить();
	ТаблицаДней.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	
	Для Каждого СтрокаТЧ Из ТаблицаДней Цикл
		
		ДнейВСтроке = (НачалоДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала)) / 86400 + 1;
		СтрокаТЧ.КоличествоДней = ДнейВСтроке;
		
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Сотрудник     = СтрокаТЧ.Сотрудник;
		Движение.ДатаНачала    = СтрокаТЧ.ДатаНачала;
		Движение.ДатаОкончания = СтрокаТЧ.ДатаОкончания;
		Движение.ВсегоДней     = ДнейВСтроке;

		Движение = Движения.ВКМ_УчетОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = СтрокаТЧ.ДатаОкончания;
		Движение.Сотрудник = СтрокаТЧ.Сотрудник;
		Движение.Значение = ДнейВСтроке;
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ОтпускаСотрудников Цикл
		
		Для Каждого СтрокаДляСравнения Из ОтпускаСотрудников Цикл
			
			Если ТекущаяСтрока.НомерСтроки = СтрокаДляСравнения.НомерСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			Если (ТекущаяСтрока.ДатаНачала <= СтрокаДляСравнения.ДатаОкончания) 
				И (ТекущаяСтрока.ДатаОкончания >= СтрокаДляСравнения.ДатаНачала) Тогда
				
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Внимание! Отпуск сотрудника %1 пересекается с отпуском сотрудника %2 в периоде с %3 по %4!'"),
					ТекущаяСтрока.Сотрудник, 
					СтрокаДляСравнения.Сотрудник, 
					Формат(Макс(ТекущаяСтрока.ДатаНачала, СтрокаДляСравнения.ДатаНачала), "ДЛФ=D"),
					Формат(Мин(ТекущаяСтрока.ДатаОкончания, СтрокаДляСравнения.ДатаОкончания), "ДЛФ=D"));
				
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;


	СписокСотрудников = ТаблицаДней.ВыгрузитьКолонку("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикОтпусков.ВсегоДней) КАК ВсегоДнейВБазе
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Сотрудник В (&СписокСотрудников)
		|	И ГОД(ВКМ_ГрафикОтпусков.ДатаНачала) = &Год
		|	И ВКМ_ГрафикОтпусков.Регистратор <> &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусков.Сотрудник";

	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Запрос.УстановитьПараметр("Год",               Год);
	Запрос.УстановитьПараметр("Ссылка",            Ссылка);
	
	ТаблицаБазы = Запрос.Выполнить().Выгрузить();
	ТаблицаБазы.Индексы.Добавить("Сотрудник");

	ТаблицаДней.Свернуть("Сотрудник", "КоличествоДней");

	Для Каждого СтрокаДок Из ТаблицаДней Цикл
		
		СтрокаБазы = ТаблицаБазы.Найти(СтрокаДок.Сотрудник, "Сотрудник");
		ДнейВБазе = ?(СтрокаБазы = Неопределено, 0, СтрокаБазы.ВсегоДнейВБазе);
		
		Если (ДнейВБазе + СтрокаДок.КоличествоДней) > 28 Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У сотрудника %1 отпуск в документе более 28 дней за %2 год, перед проведением документа проверьте право на отпуск! (Уже есть: %3, в документе: %4)'"),
				СтрокаДок.Сотрудник, Формат(Год, "ЧГ=0"), ДнейВБазе, СтрокаДок.КоличествоДней);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
#КонецЕсли
